Repository: djinilabs/timeclout
Catalog: libs/locales/src/messages/*/messages.po
Languages: pt

source: User not found
pt: Utilizador não encontrado

source: Name is required
pt: O nome é obrigatório

source: Unit not found
pt: Unidade não encontrada

source: User is not a member of this team
pt: O utilizador não é membro desta equipa

source: Shift position not found
pt: Posição de turno não encontrada

source: Shift position {shiftPositionSk} not found
pt: Posição de turno {shiftPositionSk} não encontrada

source: Leave request not found
pt: Pedido de ausência não encontrado

source: You are not allowed to update this leave request
pt: Não tem permissão para atualizar este pedido de ausência

source: You are not allowed to reject this leave request
pt: Não tem permissão para rejeitar este pedido de ausência

source: Leave not found
pt: Ausência não encontrada

source: You are not allowed to delete this leave
pt: Não tem permissão para eliminar esta ausência

source: User is not in the specified team
pt: O utilizador não pertence à equipa especificada

source: Company not found
pt: Empresa não encontrada

source: Company with pk {companyPk} not found
pt: Empresa com pk {companyPk} não encontrada

source: Company has units, cannot delete
pt: A empresa tem unidades, não pode ser eliminada

source: User does not have permission of level {minimumPermission} to access this resource ({resource})
pt: O utilizador não tem permissões do nível {minimumPermission} para aceder a este recurso ({resource})

source: Shift position {shiftPositionId} not found
pt: Posição de turno {shiftPositionId} não encontrada

source: Invalid leave request pk: {pk}
pt: PK de pedido de ausência inválido: {pk}

source: No unit managers found for the units the user is in
pt: Não foram encontrados gestores de unidade para as unidades do utilizador

source: Company leave type settings not found
pt: Configurações do tipo de ausência da empresa não encontradas

source: Leave type not found
pt: Tipo de ausência não encontrado

source: Leave request overlaps with existing {type} of type {culpritType} for day {day}
pt: O pedido de ausência sobrepõe-se a {type} existente do tipo {culpritType} para o dia {day}

source: Leave request overlaps with existing {type} of type {culpritType}
pt: O pedido de ausência sobrepõe-se a {type} existente do tipo {culpritType}

source: User location settings not found
pt: Configurações de localização do utilizador não encontradas

source: Invited to entity not found
pt: Entidade convidada não encontrada

source: Entity with pk {entityRef} not found
pt: Entidade com pk {entityRef} não encontrada

source: Error getting entity settings for entity: {entityPk} and settings key: {settingsKey}: {settings}: {errorMessage}
pt: Erro ao obter configurações da entidade: {entityPk} e chave de configuração: {settingsKey}: {settings}: {errorMessage}

source: Error parsing entity settings for entity: {entityPk} and settings key: {settingsKey}: {settings}: {errorMessage}
pt: Erro ao analisar configurações da entidade: {entityPk} e chave de configuração: {settingsKey}: {settings}: {errorMessage}

source: Invitation not found
pt: Convite não encontrado

source: Team not found
pt: Equipa não encontrada

source: Of {workersCount} workers, none is available to work on day {day} for shift {shiftType}. For this shift we had {qualifiedWorkersCount} workers with at least one of the required qualifications and {availableWorkersCount} available.
pt: De {workersCount} trabalhadores, nenhum está disponível para trabalhar no dia {day} para o turno {shiftType}. Para este turno tínhamos {qualifiedWorkersCount} trabalhadores com pelo menos uma das qualificações necessárias e {availableWorkersCount} disponíveis.

source: Worker {workerPk} not found
pt: Trabalhador {workerPk} não encontrado

source: from and weights must have the same length
pt: from e weights devem ter o mesmo comprimento

source: No element selected
pt: Nenhum elemento selecionado

source: not enough items to select
pt: itens insuficientes para selecionar

source: tryFrom is undefined
pt: tryFrom não está definido

source: count must be smaller or equal to from array
pt: a contagem deve ser menor ou igual ao tamanho do array

source: No elements to select from
pt: Nenhum elemento para selecionar

source: maximumInconvenience must be a number
pt: maximumInconvenience deve ser um número

source: Rule {ruleName} not found
pt: Regra {ruleName} não encontrada

source: startTime must be less than endTime
pt: startTime deve ser menor que endTime

source: minimumFrequency must be a number
pt: minimumFrequency deve ser um número

source: minimumShiftsInStandardWorkday must be a number
pt: minimumShiftsInStandardWorkday deve ser um número

source: firstShiftAfterExtendedLeave must be an object
pt: firstShiftAfterExtendedLeave deverá ser um objecto

source: firstShiftAfterExtendedLeave must have minimumContinuousDays (number) and applicableLeaveTypes (array)
pt: firstShiftAfterExtendedLeave deve ter minimumContinuousDays (número) e applicableLeaveTypes (array)

source: team has no unit
pt: a equipa não tem unidade
