Repository: djinilabs/timeclout
Catalog: apps/frontend/src/locales/*/messages.po
Languages: pt

source: Unknown
pt: Desconhecido

source: Member
pt: Membro

source: Admin
pt: Administrador

source: Owner
pt: Proprietário

source: January
pt: Janeiro

source: February
pt: Fevereiro

source: March
pt: Março

source: April
pt: Abril

source: May
pt: Maio

source: June
pt: Junho

source: July
pt: Julho

source: August
pt: Agosto

source: September
pt: Setembro

source: October
pt: Outubro

source: November
pt: Novembro

source: December
pt: Dezembro

source: Teams
pt: Equipas

source: Settings
pt: Configurações

source: Members
pt: Membros

source: Leave Schedule
pt: Calendário de Ausência

source: Shifts Calendar
pt: Calendário de Turnos

source: Invitations
pt: Convites

source: Calendar integrations
pt: Integrações de calendário

source: Unit name is required
pt: O nome da unidade é obrigatório

source: Cancel
pt: Cancelar

source: Create unit
pt: Criar unidade

source: Company Units
pt: Unidades da Empresa

source: My Time Off
pt: Meus Dias de Ausência

source: My Leave Requests
pt: Meus Pedidos de Ausência

source: Company Settings
pt: Configurações da Empresa

source: Pending Leave Requests
pt: Pedidos de Ausência Pendentes

source: Create team
pt: Criar equipa

source: Create a new Company
pt: Criar nova empresa

source: Company name is required
pt: O nome da empresa é obrigatório

source: Company name
pt: Nome da empresa

source: Create company
pt: Criar empresa

source: Shift position created
pt: Posição de turno criada

source: Shift position updated
pt: Posição de turno atualizada

source: Shift position moved
pt: Posição de turno movida

source: Shift position copied
pt: Posição de turno copiada

source: Shift position deleted
pt: Posição de turno apagada

source: Error fetching companies: {message}
pt: Error a obter empresas: {message}

source: Invitation accepted
pt: Convite aceite

source: Invitation details
pt: Detalhes do convite

source: Accept invitation to join
pt: Aceitar convite

source: Welcome to TimeHaupt! Let us show you around.
pt: Bem-vindo ao TimeHaupt! Deixe-nos mostrar-lhe o sistema.

source: Here you can see all your companies and their key information.
pt: Aqui pode ver todas as suas empresas e as suas informações principais.

source: Click here to create a new company.
pt: Clique aqui para criar uma nova empresa.

source: Fill in your company details here.
pt: Preencha os detalhes da sua empresa aqui.

source: Enter your company name.
pt: Introduza o nome da sua empresa.

source: Click here to create your company.
pt: Clique aqui para criar a sua empresa.

source: This is your company dashboard. Here you can see an overview of your company.
pt: Este é o painel da sua empresa. Aqui pode ver uma visão geral da sua empresa.

source: Here you can see all the units in your company.
pt: Aqui pode ver todas as unidades da sua empresa.

source: Click here to create a new unit.
pt: Clique aqui para criar uma nova unidade.

source: Access company settings and configurations here.
pt: Aceda às configurações da empresa aqui.

source: Fill in your unit details here.
pt: Preencha os detalhes da sua unidade aqui.

source: Enter your unit name.
pt: Introduza o nome da sua unidade.

source: Click here to create your unit.
pt: Clique aqui para criar a sua unidade.

source: This is your unit dashboard. Here you can manage your unit.
pt: Este é o painel da sua unidade. Aqui pode gerir a sua unidade.

source: Here you can see all the teams in this unit.
pt: Aqui pode ver todas as equipas nesta unidade.

source: Click here to create a new team.
pt: Clique aqui para criar uma nova equipa.

source: Access unit settings and configurations here.
pt: Aceda às configurações da unidade aqui.

source: Fill in your team details here.
pt: Preencha os detalhes da sua equipa aqui.

source: Enter your team name.
pt: Introduza o nome da sua equipa.

source: Click here to create your team.
pt: Clique aqui para criar a sua equipa.

source: This is your team dashboard. Here you can manage your team members and their leave requests.
pt: Este é o painel da sua equipa. Aqui pode gerir os membros da sua equipa e os seus pedidos de ausência.

source: Here you can see all the members in this team.
pt: Aqui pode ver todos os membros desta equipa.

source: Click here to add a new team member.
pt: Clique aqui para adicionar um novo membro à equipa.

source: Invite new members to join your team.
pt: Convide novos membros para se juntarem à sua equipa.

source: View and manage team members' leave requests here.
pt: Veja e gere os pedidos de ausência dos membros da equipa aqui.

source: Add a new team member here.
pt: Adicione um novo membro à equipa aqui.

source: Enter the member's email address.
pt: Introduza o endereço de email do membro.

source: Select the member's role in the team.
pt: Selecione o papel do membro na equipa.

source: Click here to add the member to your team.
pt: Clique aqui para adicionar o membro à sua equipa.

source: Submit a new leave request here.
pt: Submeta um novo pedido de ausência aqui.

source: Select the type of leave you're requesting.
pt: Selecione o tipo de ausência que está a solicitar.

source: Choose the start and end dates for your leave.
pt: Escolha as datas de início e fim para a sua ausência.

source: Click here to submit your leave request.
pt: Clique aqui para submeter o seu pedido de ausência.

source: Here you can see and manage all pending leave requests.
pt: Aqui pode ver e gerir todos os pedidos de ausência pendentes.

source: Approve or reject leave requests here.
pt: Aprove ou rejeite pedidos de ausência aqui.

source: Update your profile information and preferences here.
pt: Atualize as suas informações de perfil e preferências aqui.

source: Update your professional name.
pt: Atualize o seu nome profissional.

source: Set your location preferences.
pt: Defina as suas preferências de localização.

source: Back
pt: Voltar

source: Close
pt: Fechar

source: Done
pt: Concluído

source: Next
pt: Seguinte

source: Skip
pt: Saltar

source: Leave request rejected
pt: Pedido de ausência rejeitado

source: Leave request approved
pt: Pedido de ausência aprovado

source: Leave request removed
pt: Pedido de ausência removido

source: Invitation sent
pt: Convite enviado

source: Please fill in all fields
pt: Por favor, preencha todos os campos

source: Team invitation form
pt: Formulário de convite para equipa

source: Email is required
pt: O email é obrigatório

source: Email address
pt: Endereço de e-mail

source: Send invitation
pt: Enviar convite

source: Cancel invitation
pt: Cancelar convite

source: User added as manager
pt: Utilizador adicionado como gerente

source: User removed as manager
pt: Utilizador removido como gerente

source: Unit Managers Section
pt: Secção dos gestores da unidade

source: List of unit managers
pt: Lista de gestores da unidade

source: Remove {name} as manager
pt: Remover {name} como gerente

source: Select a user to add as manager
pt: Seleccionar utilizador para adicionar como gerente

source: Are you sure you want to delete {companyName}? This action cannot be undone.
pt: Tem certeza de que deseja eliminar {companyName}? Esta ação não pode ser desfeita.

source: Delete
pt: Eliminar

source: Company deleted
pt: Empresa eliminada

source: Shift positions unassigned successfully
pt: As atribuições das posições de turno foram removidas com sucesso

source: Select date range for unassigning shift positions
pt: Seleccionar intervalo de datas para remover atribuições de posição de turno

source: Unassign shift actions
pt: Acções de remoção de atribuições de posições de turno

source: Cancel unassigning shift positions
pt: Cancelar remoção de atribuições de posições de turno

source: Unassign shift positions for selected date range
pt: Remover atribuições de posição de turno para o intervalo de datas seleccionado

source: Are you sure you want to remove this team?
pt: Tem a certeza de que deseja remover esta equipa?

source: Remove team
pt: Remover equipa

source: Team removed successfully
pt: Equipa removida com sucesso

source: Open actions menu
pt: Abrir menu de acções

source: Open schedule options menu
pt: Abrir menu de opções de calendário

source: By day
pt: Por dia

source: By member
pt: Por membro

source: By duration
pt: Por duração

source: Stats
pt: Estatísticas

source: Calendar view options
pt: Opções de vista de calendário

source: Delete template
pt: Remover modelo

source: Delete day template
pt: Remover modelo de dia

source: Team shifts calendar
pt: Calendário de turnos da equipa

source: Analysis settings
pt: Configurações de Análise

source: Calendar view by day
pt: Vista de calendário por dia

source: Calendar view by member
pt: Vista de calendário por membro

source: Team shifts summary
pt: Sumário de turnos da equipa

source: Shift positions reverted successfully
pt: Posições de turno revertidas com sucesso

source: Select date range for reverting shift positions
pt: Seleccione o intervalo de datas dentro do qual deseja reverter as alterações às posições de turno

source: Revert shift actions
pt: Accções relacionadas com a reversão de posições de turno

source: Cancel reverting shift positions
pt: Cancelar a reversão de posições de turno

source: Revert shift positions for selected date range
pt: Reverter as posições de turno para o intervalo de datas seleccionado

source: Create shift position template dialog
pt: Diálogo para criação de modelo de posição de turno

source: Shift positions assigned successfully
pt: Posições de turno atribuídas com sucesso

source: Shift position unassigned successfully
pt: Atribuições de posição de turno removidas com sucesso

source: Calendar
pt: Calendário

source: Shift positions published successfully
pt: Posições de turno publicadas com sucesso

source: Select date range for publishing shift positions
pt: Seleccione intervalo de datas no qual reverter as alterações às posições de turno

source: Publish shift actions
pt: Accções relativas à publicação de posições de turno

source: Cancel publishing shift positions
pt: Cancelar a publicação de posições de turno

source: Publish shift positions for selected date range
pt: Publicar as posições de turno para o intervalo de datas seleccionado

source: Create or edit schedule day template dialog
pt: Diálogo de criação de modelo de dia

source: Qualifications
pt: Qualificações

source: Schedule Position Templates
pt: Modelos de Turno

source: Qualifications changed
pt: Qualificações alteradas

source: Team schedule position templates saved
pt: Modelos de turno da equipa guardados

source: Team schedule position templates
pt: Templates de posição de turno

source: Schedule position template
pt: Template de posição de turno

source: Qualification name
pt: Nome da Qualificação

source: Select color
pt: Seleccionar cor

source: Open color options
pt: Abrir opções de cor

source: Color options
pt: Opções de cor

source: Remove qualification
pt: Remover qualificação

source: Save schedule position template changes
pt: Gravar alterações na template de posição de turno

source: Use template for position
pt: Usar template para esta posição

source: Team qualifications saved
pt: Qualificações da equipa guardadas

source: Team Qualifications
pt: Qualificações de equipa

source: Qualification
pt: Qualificação

source: Select qualification color
pt: Seleccione a cor da qualificação

source: Available colors
pt: Cores disponíveis

source: Add new qualification
pt: Adicionar nova qualificação

source: Save qualification changes
pt: Gravar alterações na qualificação

source: Team leaves calendar
pt: Calendário de ausências da equipa

source: Copied!
pt: Copiado!

source: Copy URL
pt: Copiar URL

source: Schedule Analysis Options
pt: Opções de Análise

source: Holidays Options
pt: Opções de ausências

source: Book Company Time Off
pt: Pedir ausência

source: Leave request created successfully
pt: Pedido de ausência criado com sucesso

source: Leave quota fulfillment for {name}
pt: Preenchimento de quota de ausências para {name}

source: Please fill in all fields correctly
pt: Por favor preencha todos os campos corretamente

source: Professional name
pt: Nome profissional

source: Please enter a valid email address
pt: Por favor introduza um endereço de email válido

source: Cancel team member changes
pt: Cancelar alterações ao membro da equipa

source: Save team member changes
pt: Gravar alterações ao membro da equipa

source: Create new team member
pt: Criar novo membro da equipa

source: Number of shifts
pt: Número de turnos

source: Hours between shifts
pt: Número de horas entre turnos

source: Your profile has been updated
pt: O seu perfil foi atualizado

source: Personal information form
pt: Formulário de informação pessoal

source: Professional name is required
pt: O nome profissional é obrigatório

source: Cancel profile changes
pt: Cancelar alterações do perfil

source: Save profile changes
pt: Guardar alterações do perfil

source: Days between shifts
pt: Número de dias entre turnos

source: Inconvenience:Deviation from Expected
pt: Inconveniência: Desvio do Esperado

source: Select a country
pt: Seleccionar um país

source: Select a region
pt: Seleccionar uma região

source: Profile
pt: Perfil

source: Sign out
pt: Sair

source: Member {name}
pt: Membro {name}

source: View {type} leave request for {member} on {date}
pt: Ver ausência do tipo {type} para {member} na data {date}

source: {type} leave for {member}
pt: Ausência do tipo {type} para o membro {member}

source: {type} leave for {member} on {date}
pt: Ausência do tipo {type} para {member} na data {date}

source: Add leave
pt: Nova ausência

source: Switch to daily calendar view
pt: Mudar para vista de calendário por dia

source: Switch to view per day
pt: Mudar para vista por dia

source: Switch to member list view
pt: Mudar para vista por membro

source: Switch to view per member
pt: Mudar para vista por membro

source: Team leave schedule for {month} {year}
pt: Calendário de ausências da equipa para {month} de {year}

source: Home
pt: Início

source: Leave Requests
pt: Pedidos de Ausência

source: Top Score
pt: Pontuação mais alta

source: Top score
pt: Pontuação máxima

source: This solution score
pt: A pontuação desta solução

source: Leave type editor form
pt: Formulário de tipo de ausência

source: Leave type name
pt: Nome de tipo de ausência

source: Show in calendar as
pt: Mostrar no calendário como

source: Busy
pt: Ocupad@

source: Available
pt: Disponível

source: Out of Office
pt: Ausente

source: Visible to
pt: Visível para

source: Managers only
pt: Somente gerentes

source: All employees
pt: Todos os membros

source: Requires manager approval
pt: Requer aprovação do gerente

source: Save
pt: Gravar

source: e.g., City General Hospital
pt: ex., Hospital Geral da Cidade

source: e.g., Emergency Department
pt: ex., Departamento de Emergência

source: e.g., Night Shift Team
pt: ex., Equipe do Turno Noturno

source: Initializing demo account...
pt: Inicializando conta de demonstração...

source: Setting up your industry-specific company structure...
pt: Configurando a estrutura da empresa específica do setor...

source: Creating company...
pt: Criando empresa...

source: Setting up company settings and work schedules...
pt: Configurando definições da empresa e horários de trabalho...

source: Creating unit...
pt: Criando unidade...

source: Setting up organizational structure...
pt: Configurando estrutura organizacional...

source: Creating team...
pt: Criando equipe...

source: Setting up team configuration...
pt: Configurando configuração da equipe...

source: Adding team members...
pt: Adicionando membros da equipe...

source: Creating realistic user profiles with qualifications...
pt: Criando perfis de usuário realistas com qualificações...

source: Setting up shifts and schedules...
pt: Configurando turnos e cronogramas...

source: Creating industry-appropriate work schedules...
pt: Criando horários de trabalho apropriados para o setor...

source: Failed to populate demo account: {message}
pt: Falha ao popular conta de demonstração: {message}

source: Demo account created successfully!
pt: Conta de demonstração criada com sucesso!

source: Redirecting to your new company...
pt: Redirecionando para sua nova empresa...

source: An unexpected error occurred: {message}
pt: Ocorreu um erro inesperado: {message}

source: Leave type created
pt: Tipo de ausência criado

source: Settings updated
pt: Configurações atualizadas

source: Work schedule updated successfully
pt: Horário de trabalho atualizado com sucesso

source: Company work schedule form
pt: Formulário de horário de trabalho

source: Start time for {day}
pt: Hora de início para {day}

source: End time
pt: Hora de fim

source: Save changes
pt: Gravar alterações

source: Leave Types
pt: Tipos de Ausência

source: Yearly quota
pt: Quota Anual

source: Work schedule
pt: Horário de Trabalho

source: Leave request submitted
pt: Pedido de ausência submetido

source: Leave requests submitted
pt: Pedido de ausência submetido

source: Error fetching holidays: {message}
pt: Erro a obter ausências: {message}

source: Leave type deleted
pt: Tipo de ausência removido

source: Settings updated successfully
pt: Configurações atualizadas com sucesso

source: Company yearly quota form
pt: Formulário de quota anual

source: Reset month
pt: Mês de reinício

source: Default yearly quota
pt: Quota anual por omissão

source: Shift options menu
pt: Menu de opções de turno

source: Edit shift
pt: Alterar turno

source: Copy shift
pt: Copiar turno

source: Paste shift here
pt: Colar turno aqui

source: Delete shift
pt: Remover turno

source: Unassign shift
pt: Remover atribuição de turno

source: Unpublished
pt: Não publicado

source: Published
pt: Publicado

source: Please select a permission
pt: Por favor, selecione uma permissão

source: Please select a user
pt: Por favor seleccione um membro

source: Are you sure you want to delete this unit?
pt: Tem a certeza de que deseja remover esta unidade?

source: Delete unit
pt: Remover unidade

source: Unit deleted successfully
pt: Unidade removida com sucesso

source: Book company time off form
pt: Formulário de pedido de ausência

source: Please provide a reason for your leave request.
pt: Por favor, forneça um motivo para sua solicitação de ausência.

source: Reason for leave
pt: Razão da ausência

source: Enter your email address
pt: Introduza o seu endereço de email

source: Select a color
pt: Seleccione uma cor

source: Select {color} color
pt: Seleccionar cor {color}

source: Leave conflict detected
pt: Detetado conflito com ausência

source: Maximum interval between shifts rule violated
pt: Regra de intervalo máximo entre turnos violada

source: Minimum number of shifts per week in standard workday rule violated
pt: Violação da regra de número mínimo de turnos durante a semana de trabalho

source: Minimum rest slots after shift rule violated
pt: Violação da regra de horas de descanso depois de turno

source: Inconvenience Equality Deviation
pt: Desvio da Igualdade de Inconveniência

source: Slot Equality Deviation
pt: Desvio da Igualdade de número de Posições atribuidas

source: Slot Proximity Equality Deviation
pt: Desvio da Igualdade de Proximidade

source: <0>Perfect for:</0> Learning the platform, testing features, demonstrations, or getting a quick start on your real company setup.
pt: <0>Perfeito para:</0> Aprender a plataforma, testar funcionalidades, demonstrações, ou obter um início rápido na configuração da sua empresa real.

source: 5-10 realistic team members with names & emails
pt: 5-10 membros da equipe realistas com nomes e emails

source: 5-8 realistic leave requests
pt: 5-8 pedidos de ausência realistas

source: A complete, industry-specific company setup ready for immediate exploration
pt: Uma configuração completa de empresa específica do setor pronta para exploração imediata

source: Accept Invitation
pt: Aceitar Convite

source: Acceptable Qualifications
pt: Qualificações aceitáveis

source: Actions
pt: Acções

source: Add a manager
pt: Adicionar um gerente

source: Add a new team member to the team.
pt: Adicionar um novo membro à equipa.

source: Add position
pt: Adicionar posição

source: Add qualification
pt: Adicionar qualificação

source: Add Qualification
pt: Adicionar Qualificação

source: Add qualifications
pt: Adicionar qualificações

source: Add your personal information to help us identify you.
pt: Adicione suas informações pessoais para nos ajudar a identificá-lo.

source: Adjust these parameters to control how the automatic assignment balances different priorities
pt: Ajuste estes parâmetros para controlar como a atribuição automática equilibra diferentes prioridades

source: All positions in these dates have no changes
pt: Todas as posições nestas datas não têm alterações

source: Analyze
pt: Analisar

source: Analyze worker inconvenience equality
pt: Analisar igualdade de inconveniência

source: Analyze worker slot equality
pt: Analisar igualdade de número de posições atribuidas

source: Analyze worker slot proximity
pt: Analisar proximidade de posições atribuídas

source: Applicable leave types:
pt: Tipos de licença aplicáveis:

source: Appropriate work schedules & shift patterns
pt: Horários de trabalho e padrões de turno apropriados

source: Approve leave request
pt: Aprovar solicitação de ausência

source: Approved
pt: Aprovado

source: Approved By
pt: Aprovado por

source: Are you sure you want to assign these shift positions?
pt: Tem a certeza de que deseja atribuir estas posições de turno?

source: Are you sure you want to delete the selected shift positions?
pt: Tem a certeza de que deseja remover as posições de turno seleccionadas?

source: Are you sure you want to delete this leave type? This change is not reversible.
pt: Tem a certeza de que deseja remover este tipo de ausência? Esta alteração não é reversível.

source: Are you sure you want to publish the shift positions for this team between {0} and {1}?
pt: Tem a certeza de que deseja publicar as alterações às posições de turno entre {0} e {1}?

source: Are you sure you want to remove this leave request?
pt: Tem a certeza de que desejar remover este pedido de ausência?

source: Are you sure you want to remove this user from the team?
pt: Tem a certeza de que deseja remover este membro da equipa?

source: Are you sure you want to revert the changes made to the shift positions for this team between {0} and {1}?
pt: Tem a certeza de que deseja reverter as alterações feitas às posições de turno para esta equipa entre {0} e {1}?

source: Are you sure you want to revoke this invitation?
pt: Tem a certeza de que deseja remover este convite?

source: Are you sure you want to unassign the shift positions between {0} and {1}?
pt: Tem a certeza de que deseja remover as atribuições de posição de turnos entre {0} e {1}?

source: Assign
pt: Atribuir

source: Assign the managers for the workers in this unit:
pt: Atribua os gerentes para os trabalhadores nesta unidade:

source: Assigned to
pt: Atribuído a

source: Assigning Shift Positions...
pt: Atribuindo posições de turno...

source: at for Saturday
pt: áb

source: Attention needed
pt: Atenção necessária

source: Auto fill
pt: Auto preenchimento

source: Available Shift Position Templates
pt: Modelos de turno disponíveis

source: Avoid Non-Work Day First Shift
pt: Evitar Primeiro Turno em Dia Não Útil

source: Back to sign-in options
pt: Regressar a opções de entrada

source: Beneficiary
pt: Beneficiário

source: By saving this as a template, you can reuse it to create new positions in the future.
pt: Guardando como modelo, pode reutilizá-lo para criar novas posições no futuro.

source: Calendar subscriptions:
pt: Subscrições de calendário

source: Can be modified or deleted anytime
pt: Pode ser modificado ou eliminado a qualquer momento
