Repository: djinilabs/timeclout
Catalog: apps/frontend/src/locales/*/messages.po
Languages: pt

source: You have been invited to join "<0>{0}</0>" with permission level "{1}".
pt: Foi convidado para se juntar a "<0>{0}</0>" com nível de permissão "{1}".

source: You have no pending leave requests
pt: Não tem pedidos de ausência pendentes

source: You will have exceeded your quota by <0>{0} days</0>.
pt: Vai exceder a sua cota em <0>{0} dias</0>.
