Repository: djinilabs/timeclout
Catalog: apps/frontend/src/locales/*/messages.po
Languages: pt

source: Choose the type of department or unit for your company
pt: Escolha o tipo de departamento ou unidade para sua empresa

source: Choose Your Industry
pt: Escolha Seu Setor

source: Choose your preferred sign-in method
pt: Escolha o seu método preferido de entrada

source: Click the button below to accept the invitation.
pt: Clique no botão abaixo para aceitar o convite.

source: Color
pt: Cor

source: Companies
pt: Empresas

source: Company
pt: Empresa

source: Company Name
pt: Nome da Empresa

source: Company Structure
pt: Estrutura da Empresa

source: Configure the standard work schedule for employees in this company:
pt: Configure o horário de trabalho padrão para os funcionários nesta empresa:

source: Configure the yearly leave quota settings for employees in this company:
pt: Configure as configurações de cota anual de ausência para os funcionários nesta empresa:

source: conflict(s) when trying to search for a solution
pt: Conflito(s) enquanto pesquisando por solução

source: Contact our support team
pt: Contacte a nossa equipa de suporte

source: Continue with Google
pt: Continuar com Google

source: Copy
pt: Copiar

source: Country
pt: País

source: Create
pt: Criar

source: Create {0} leave
pt: Criar ausência para {0}

source: Create a new leave type for your company
pt: Criar um novo tipo de ausência para a sua empresa

source: Create a new Unit
pt: Criar uma nova unidade

source: Create a position template.
pt: Criar um modelo de posição

source: Create a schedule day template.
pt: Criar um modelo de dia

source: Create Company Manually
pt: Criar Empresa Manualmente

source: Create Day Template
pt: Criar um modelo de dia

source: Create Demo Company
pt: Criar Empresa de Demonstração

source: Create member user
pt: Criar utilizador membro

source: Create new company
pt: Criar nova empresa

source: Create New Leave Type
pt: Criar um novo tipo de ausência

source: Create new team
pt: Criar nova equipa

source: Create new Unit
pt: Criar nova unidade

source: Create or edit schedule day template
pt: Criar ou editar um modelo de dia

source: Create shift position template
pt: Criar um modelo de posição de turno

source: Create Team Member
pt: Criar membro da equipa

source: Create template
pt: Criar modelo

source: Create Template
pt: Criar modelo

source: Create Your Demo Company
pt: Crie Sua Empresa de Demonstração

source: Created
pt: Criado

source: Created At
pt: Criado a

source: Created by
pt: Criado por

source: Created By
pt: Criado por

source: Creating Demo Company...
pt: Criando Empresa de Demonstração...

source: Current Step
pt: Passo Atual

source: Custom Names (Optional)
pt: Nomes Personalizados (Opcional)

source: Date range
pt: Intervalo de datas

source: Day
pt: Dia

source: Day and week schedule templates
pt: Modelos de cronogramas diários e semanais

source: Day Template Contents
pt: Conteúdos do modelo de dia

source: Day Templates
pt: Modelos de dia

source: Deducts from annual allowance
pt: Deduz da cota anual

source: Default Yearly Quota (days)
pt: Cota anual padrão (dias)

source: Demo Account Created Successfully!
pt: Conta de Demonstração Criada com Sucesso!

source: Department/Unit Type
pt: Tipo de Departamento/Unidade

source: Department/unit with appropriate naming
pt: Departamento/unidade com nomenclatura apropriada

source: Details
pt: Detalhes

source: Discarded Schedules
pt: Agendamentos descartados

source: Display Options
pt: Opções de visualização

source: Drag templates from here to add them to your day template
pt: Arraste modelos de posição de turno daqui para adicioná-los ao seu modelo de dia

source: Drop shift position templates here
pt: Largue modelos de posição de turno aqui

source: Drop zone for shift position templates
pt: Zona de queda para modelos de posição de turno

source: Edit
pt: Editar

source: Edit a position in the team schedule.
pt: Editar uma posição no horário da equipa.

source: Edit a team member to the team.
pt: Editar um membro da equipa.

source: Edit position
pt: Editar posição de turno

source: Edit Team Member
pt: Editar membro da equipa

source: Edit the leave type "{0}"
pt: Editar o tipo de ausência "{0}"

source: End
pt: Fim

source: End Date
pt: Data de fim

source: Enter your email
pt: Introduza o seu endereço de email

source: Error loading calendar data
pt: Erro ao carregar dados do calendário

source: Error loading calendar data. Please refresh to try again.
pt: Erro a carregar dados do calendário. Por favor refresque para tentar outra vez.

source: F for Friday
pt: S

source: Fill in all the form fields
pt: Preencha todos os campos do formulário

source: Filter users
pt: Filtrar membros

source: Filters
pt: Filtros

source: Fine-tune parameters
pt: Ajustar parâmetros

source: For shifts with inconvenience score ≤
pt: Para turnos com pontuação de inconveniência ≤

source: For the quota starting at {0} and ending at {1} they have used <0>{2} days</0> and have <1>{3} days</1> pending approval.
pt: Para a cota que começa em {0} e termina em {1}, usaram <0>{2} dias</0> e têm <1>{3} dias</1> pendentes de aprovação.

source: For the quota starting at {0} and ending at {1} you have used <0>{2} days</0> and have <1>{3} days</1> pending approval.
pt: Para a cota que começa em {0} e termina em {1}, usou <0>{2} dias</0> e tem <1>{3} dias</1> pendentes de aprovação.

source: From
pt: De

source: From {0} to {1}
pt: De {0} a {1}

source: Future-dated requests for testing
pt: Pedidos futuros para teste

source: Get started by creating a new team for this unit.
pt: Comece por criar uma nova equipa para esta unidade.

source: Get started by creating a new unit for this company.
pt: Comece por criar uma nova unidade para esta empresa.

source: Get started quickly with a complete company setup, or build your own from scratch. Choose the option that works best for you.
pt: Comece rapidamente com uma configuração completa da empresa, ou construa a sua do zero. Escolha a opção que funciona melhor para você.

source: Go to today
pt: Ir para hoje

source: Healthcare, Retail, Manufacturing, etc.
pt: Saúde, Retalho, Manufatura, etc.

source: Here you can invite users to your team.
pt: Aqui pode convidar utilizadores para a sua equipa.

source: Higher values ensure workers get a more equal distribution of total shifts
pt: Valores mais altos garantem que os funcionários recebem uma distribuição mais igualitária do total de turnos

source: Higher values ensure workers get similar levels of inconvenient shifts (nights, weekends)
pt: Valores mais altos garantem que os funcionários recebem níveis semelhantes de turnos inconvenientes (noites, fins de semana)

source: Higher values try to avoid scheduling workers' first shift of the week on non-work days (e.g., weekends)
pt: Valores mais altos tentam evitar agendar o primeiro turno da semana dos trabalhadores em dias não úteis (ex: fins de semana)

source: Higher values try to equalize the spread of shifts for each worker through time
pt: Valores mais altos tentam igualar a distribuição de turnos para cada funcionário ao longo do tempo

source: Holidays
pt: Ausências

source: hours rest
pt: horas de descanso

source: How many team members should we create? (Recommended: 5-10)
pt: Quantos membros da equipe devemos criar? (Recomendado: 5-10)

source: hu for Thursday
pt: ui

source: Icon
pt: Ícone

source: Ignore for now
pt: Ignorar por agora

source: Immediate access to all platform features
pt: Acesso imediato a todas as funcionalidades da plataforma

source: In Apple Calendar: File > New Calendar Subscription and paste the URL
pt: No Calendário Apple: Ficheiro > Nova Subscrição de Calendário e cole o URL

source: In Google Calendar: Click the + next to "Other calendars" > "From URL" and paste the URL
pt: No Google Calendar: Clique no + ao lado de "Outros calendários" > "Por URL" e cole o URL

source: In Outlook: Settings > Calendar > Add calendar > Subscribe from web and paste the URL
pt: No Outlook: Definições > Calendário > Adicionar calendário > Subscrever da web e cole o URL

source: Inconvenience
pt: Inconveniência

source: Inconvenience Deviation
pt: Desvio de Inconveniência

source: Industry Customization
pt: Personalização do Setor

source: Industry-appropriate work hours
pt: Horários de trabalho apropriados para o setor

source: Industry-specific company with realistic name
pt: Empresa específica do setor com nome realista

source: Industry-specific roles (nurses, sales associates, etc.)
pt: Funções específicas do setor (enfermeiros, vendedores, etc.)

source: Industry-specific roles & qualifications
pt: Funções e qualificações específicas do setor

source: Insert a position into the team schedule.
pt: Inserir uma posição no horário da equipa.

source: Insert position into the team schedule
pt: Inserir posição no horário da equipa

source: Invitation not found
pt: Convite não encontrado

source: Invite
pt: Convidar

source: Invite a team member to join your team.
pt: Convidar um membro da equipa para se juntar à sua equipa.

source: Invite to team
pt: Convidar para equipa

source: Invited
pt: Convidado

source: Joined
pt: Adicionado

source: Leave Request
pt: Pedido de ausência

source: Leave request type
pt: Tipo do pedido de ausência

source: Leave these empty to use industry-appropriate auto-generated names, or customize them to your preference.
pt: Deixe vazio para usar nomes gerados automaticamente apropriados para o setor, ou personalize conforme sua preferência.

source: Leave Type "{0}"
pt: Tipo de ausência "{0}"

source: LeaveRequest not found
pt: Pedido de ausência não encontrado

source: Leaves
pt: Ausências

source: leaving them with <0>{simulatedDaysLeft} days</0> left.
pt: deixando-os com <0>{simulatedDaysLeft} dias</0> restantes.

source: leaving you with <0>{simulatedDaysLeft} days</0> left.
pt: deixando-o com <0>{simulatedDaysLeft} dias</0> restantes.

source: Loading calendar...
pt: A carregar calendário...

source: M for Monday
pt: S

source: Manage the leave types for the workers in this company:
pt: Gira os tipos de ausência para os funcionários nesta empresa:

source: Minimum continuous days:
pt: Dias contínuos mínimos:

source: More Details
pt: Mais detalhes

source: Multiple shift patterns (day, night, weekend)
pt: Múltiplos padrões de turnos (dia, noite, fim de semana)

source: Name
pt: Nome

source: Need More Help?
pt: Necessita de ajuda adicional?

source: New Invitation
pt: Novo convite

source: New Team
pt: Nova equipa

source: New Unit
pt: Nova unidade

source: next day
pt: dia seguinte

source: Next month
pt: Mês seguinte

source: Next year
pt: Ano seguinte

source: No assignable team members
pt: Não foram encontrados membros atribuíveis

source: No day templates found.
pt: Não foram encontrados modelos

source: No invitations found.
pt: Nenhum convite encontrado.

source: No location settings found for {0}
pt: Nenhuma configuração de localização encontrada para {0}

source: No managers assigned
pt: Nenhum gestor atribuído

source: No qualifications available for this team.
pt: Nenhuma qualificação disponível para esta equipa.

source: No shift position templates available.
pt: Não tem modelos de posição de turno disponíveis.

source: No shift position templates found.
pt: Não tem modelos de posição de turno

source: No teams
pt: Nenhuma equipa

source: No units
pt: Nenhuma unidade

source: on for Monday
pt: eg

source: Open menu
pt: Abrir menu

source: Open options
pt: Abrir opções

source: Open user menu
pt: Abrir menu de utilizador

source: Options
pt: Opções

source: or
pt: ou

source: Paste here
pt: Colar aqui

source: Pending
pt: Pendente

source: Perfect for learning and demonstrations
pt: Perfeito para aprendizado e demonstrações

source: Permission
pt: Permissão

source: Personal Information
pt: Informação pessoal

source: Pick a color
pt: Escolher uma cor

source: Please wait while we create your company structure...
pt: Por favor aguarde enquanto criamos a estrutura da sua empresa...

source: Position Templates
pt: Modelos de posição

source: Prerequisites
pt: Pré-requisitos

source: Previous month
pt: Mês anterior

source: Previous year
pt: Ano anterior

source: Progress
pt: Progresso

source: Proper team hierarchy and permissions
pt: Hierarquia e permissões adequadas da equipe

source: Publish changes
pt: Publicar alterações

source: Publish shift positions
pt: Publicar posições de turno

source: Publish Shift Positions
pt: Publicar posições de turno

source: Publish shift positions from {0} to {1}
pt: Publicar posições de turno de {0} a {1}

source: Quick Actions
pt: Ações rápidas

source: Quick Start with Demo Data
pt: Início Rápido com Dados de Demonstração

source: Range: {0} - {1} team members
pt: Intervalo: {0} - {1} membros da equipe

source: Ready to Explore
pt: Pronto para Explorar

source: Ready-to-use scheduling patterns
pt: Padrões de agendamento prontos para uso

source: Realistic company & team names
pt: Nomes realistas de empresa e equipe

source: Realistic reasons and durations
pt: Motivos e durações realistas

source: Reason
pt: Motivo

source: Reassign
pt: Reatribuir

source: Region
pt: Região

source: Reject leave request
pt: Rejeitar pedido de ausência

source: Relevant qualifications & certifications
pt: Qualificações e certificações relevantes

source: Remove
pt: Remover

source: Remove from team
pt: Remover da equipa

source: Remove leave request
pt: Remover pedido de ausência

source: Remove Qualification
pt: Remover qualificação

source: Request time off
pt: Pedir ausência

source: Request Time Off
pt: Pedir ausência

source: Request time off by filling this form:
pt: Pedir ausência preenchendo este formulário:

source: require
pt: requer

source: Require a maximum interval between shifts for each worker (in days)
pt: Requerer um intervalo máximo entre turnos para cada funcionário (em dias)

source: Require a minimum number of shifts in a standard workday for each worker each week
pt: Requerer um mínimo de turnos num dia de trabalho padrão para cada funcionário cada semana

source: Require minimum rest periods between shifts based on inconvenience scores
pt: Requerer um descanso mínimo entre turnos com base na pontuação de inconveniência

source: Require workers to be scheduled on their first shift after returning from extended leave
pt: Requerer que os trabalhadores sejam agendados no seu primeiro turno após regressar de licença prolongada

source: Reset
pt: Reiniciar

source: Reset Month
pt: Reiniciar mês

source: Respect leave schedule
pt: Respeitar o calendário de ausências

source: Revert shift positions
pt: Reverter posições de turno

source: Revert Shift Positions
pt: Reverter posições de turno

source: Revert shift positions from {0} to {1}
pt: Reverter posições de turno entre {0} e {1}

source: Revert to published
pt: Reverter para publicado

source: Revoke Invitation
pt: Revogar convite

source: ri for Friday
pt: ex

source: Role Permissions
pt: Permissões de função

source: Rules
pt: Regras

source: S for Saturday
pt: S

source: S for Sunday
pt: D

source: Sample Data
pt: Dados de Exemplo

source: Save as template
pt: Guardar como modelo

source: Save Changes
pt: Guardar alterações

source: Save Settings
pt: Guardar configurações

source: Saving...
pt: A guardar...

source: Schedule
pt: Horário

source: Schedules & Templates
pt: Cronogramas e Modelos

source: Select a unit type...
pt: Selecione um tipo de unidade...

source: Select a user
pt: Selecionar um utilizador

source: Select an industry to get realistic company names, roles, and work schedules
pt: Selecione um setor para obter nomes de empresas, funções e horários de trabalho realistas

source: Select an industry...
pt: Selecione um setor...

source: Select the date range for your leave.
pt: Selecionar o intervalo de datas para a sua ausência.

source: Select the dates
pt: Selecionar as datas

source: Select the month when the yearly leave quota should reset for all employees.
pt: Selecionar o mês quando a quota anual de ausências deve ser reiniciada para todos os funcionários.

source: Select the period for which you want to automatically assign shifts
pt: Selecionar o período para o qual deseja atribuir turnos automaticamente

source: Select the rules for which you want to enforce while automatically assign shifts
pt: Selecionar as regras para as quais deseja aplicar enquanto atribui turnos automaticamente

source: Select the user you want to request time off for.
pt: Selecionar o utilizador para o qual deseja pedir ausência.

source: Select User
pt: Selecionar utilizador

source: Send sign-in link
pt: Enviar link para entrar

source: Sending...
pt: Enviando...

source: Set a color to this position
pt: Definir uma cor para esta posição

source: Set a name for this day template
pt: Atribua um nome para este modelo de dia

source: Set a name to this position
pt: Definir um nome para esta posição

source: Set any of the qualifications that can fill this position.
pt: Definir qualquer das qualificações que podem preencher esta posição.

source: Set the day for this position.
pt: Definir o dia para esta posição.

source: Set the default number of leave days allocated to each employee per year.
pt: Definir o número padrão de dias de ausência atribuídos a cada funcionário por ano.

source: Set the schedule for this position.
pt: Definir o horário para esta posição.

source: Set the user assigned to this position.
pt: Definir o utilizador atribuído a esta posição.

source: Setting Up Your Demo Account
pt: Configurando Sua Conta de Demonstração

source: Shift Position Templates
pt: Modelos de Posição de Turno

source: Show leave conflicts
pt: Mostrar conflitos com as ausências

source: Show leave schedule
pt: Mostrar o calendário de ausências

source: Show schedule details
pt: Mostrar detalhes

source: Sign in to your account
pt: Entre na sua conta

source: Sign in with email link
pt: Entrar com link de email

source: Solution Heuristic Scores
pt: Pontuações desta solução

source: Solutions
pt: Soluções

source: Some of the positions in these dates have changes
pt: Algumas das posições nestas datas têm alterações

source: Some solutions have been discarded because of the following reasons:
pt: Algumas soluções foram descartadas por causa dos seguintes motivos:

source: Start
pt: Iniciar

source: Start Date
pt: Data de início

source: Start searching for the best solution
pt: Iniciar a pesquisa pela melhor solução

source: starting on day
pt: começando no dia

source: Status
pt: Estado

source: Stop searching
pt: Parar a pesquisa

source: Submit request for {0} and wait for approval
pt: Submeter pedido de {0} e aguardar aprovação

source: T for Tuesday
pt: T

source: T for Thursday
pt: Q

source: Team
pt: Equipa

source: Team Members
pt: Membros da Equipe

source: Team Name
pt: Nome da Equipe

source: Team Size
pt: Tamanho da Equipe

source: Team with industry-relevant roles
pt: Equipe com funções relevantes para o setor

source: Template Name
pt: Nome do modelo

source: Test scheduling, leave management, etc.
pt: Testar agendamento, gestão de ausências, etc.

source: The deviation of the inconvenience from the expected inconvenience.
pt: O desvio da inconveniência esperada

source: The most recent version of the app is available. Please update to the most recent version.
pt: Está disponível tem uma nova versão desta aplicação. Por favor atualize para a versão mais recente.

source: The number of shifts assigned to each worker for each type.
pt: O número de turnos atribuidos a cada membro por tipo de turno

source: The time between shifts for each worker. The box plot shows the median, quartiles, and outliers.
pt: O intervalo de tempo entre turnos para cada membro. O diagrama mostra a mediana, quartis e outliers.

source: There are
pt: Existem

source: These leave days will deduct <0>{0} days</0> from your quota
pt: Estas ausências deduzirão <0>{0} dias</0> da sua cota

source: They will have exceeded their quota by <0>{0} days</0>.
pt: Eles terão excedido a sua cota em <0>{0} dias</0>.

source: This may take a few moments. Please don't close this page.
pt: Isto pode demorar alguns momentos. Por favor não feche esta página.

source: Time between shifts
pt: Tempo entre turnos

source: to
pt: para

source: To create a new company you just have to fill in the company name and click on "Create".
pt: Para criar uma nova empresa, basta preencher o nome da empresa e clicar em "Criar".

source: To create a new unit you just have to fill in the unit name and click on "Create".
pt: Para criar uma nova unidade, basta preencher o nome da unidade e clicar em "Criar".

source: Today
pt: Hoje

source: Total inconvenience: {totalInconvenience}
pt: Inconveniência total: {totalInconvenience}

source: Type
pt: Tipo

source: Type of Leave
pt: Tipo de ausência

source: ue for Tuesday
pt: er

source: un for Sunday
pt: om

source: Unassign
pt: Remover atribuição

source: Unassign positions
pt: Remover atribuições de posição

source: Unassign shift positions
pt: Remover atribuições de posições de turno

source: Unassign Shift Positions
pt: Remover atribuição de posições de turno

source: Unassign shift positions from {0} to {1}
pt: Remover atribuição de posições de turno entre {0} e {1}

source: Unit
pt: Unidade

source: Unit name
pt: Nome da unidade

source: Unit Name
pt: Nome da Unidade

source: Update now
pt: Atualizar agora

source: Use a template to create this position.
pt: Usar um modelo para criar esta posição.

source: Use template
pt: Usar modelo

source: Use template?
pt: Usar modelo?

source: Use this solution and assigning these shift Positions
pt: Usar esta solução e atribuir estes turnos

source: User removed from team
pt: Utilizador removido da equipa

source: Various leave types (vacation, sick, training)
pt: Vários tipos de ausência (férias, doença, treinamento)

source: View leave request details
pt: Ver detalhes do pedido de ausência

source: View team
pt: Ver equipa

source: View unit
pt: Ver unidade

source: Visual Guide
pt: Guia visual

source: W for Wednesday
pt: Q

source: We'll generate a complete, industry-specific company structure with realistic data to help you explore all features.
pt: Geraremos uma estrutura completa de empresa específica do setor com dados realistas para ajudá-lo a explorar todas as funcionalidades.

source: We'll send you a secure link to sign in
pt: Enviaremos um link seguro para entrar

source: We'll send you a secure link to sign in without a password
pt: Enviaremos um link seguro para entrar sem senha

source: ed for Wednesday
pt: ua

source: Welcome to Your New Account!
pt: Bem-vindo à Sua Nova Conta!

source: What type of leave are you planning to take?
pt: Que tipo de ausência está a planear?

source: What You Can Do
pt: O que pode fazer

source: What You'll Get with Demo Data
pt: O Que Você Receberá com Dados de Demonstração

source: Work Days
pt: Dias de trabalho

source: Work schedule matching industry standards
pt: Horário de trabalho que atende aos padrões do setor

source: Worker Inconvenience Equality
pt: Igualdade de inconveniência do trabalhador

source: Worker Shift Equality
pt: Igualdade de turnos do trabalhador

source: Worker Shift Proximity
pt: Proximidade de turnos do trabalhador

source: You can drag and drop day templates to the team shift calendar.
pt: Pode arrastar e largar modelos de dia para cima do calendário de turnos da equipa.

source: You can drag and drop templates to the team shift calendar.
pt: Pode arrastar e largar modelos para cima do calendário de turnos

source: You can subscribe to your team's calendar using the URL below. This allows you to see team shifts directly in your calendar app. To subscribe:
pt: Pode subscrever o calendário da sua equipa usando o URL abaixo. Isto permite-lhe ver os turnos da equipa diretamente na sua aplicação de calendário. Para subscrever:

source: You have been invited
pt: Foi convidado
